cases/validate_foc/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    in
    {
	type	fixedValue;
        value   uniform (1.5 0 0);
    }
    out
    {
	type	zeroGradient;
    }

    top
    {
	type	slip;
    }
    bot
    {
	type	slip;
    }
    frontAndBack
    {
        type empty;
    }
}

// ************************************************************************* //
